//-----------------------------------------------------------------------------------------
//					[ Commodity Management Program ]
//	@Mainpage.
//	- Final Program.
//
//	@Memo
//
//
//	[Opencv 4.3.0 사용법]
//	- 새 프로젝트 만들기, Windows 데스크톱 마법사 선택
//  - Windows 데스크톱 프로젝트에서 콘솔애플리케이션, 빈프로젝트 확인
//	- Main.cpp 생성 후, Debug x64로 변경.
//	- 프로젝트의 속성을 클릭하고, 구성을 '모든 구성'으로 변경.
//	- C/C++ 탭에서 추가 포함 디렉터리에 OpenCV 헤더 파일 위치를 입력.
//  - 링커탭, 추가 라이브러리 디렉터리 입력란에 OpenVC 라이브러리 파일 위치 입력.
//  - 디버깅탭, 환경 항목에 OpenCV 라이브러리 DLL 파일 위치를 입력.
//  - 구성을 활성(Debug)로 변경하고, 설정 여부 메시지 박스에 예 버튼 클릭.
//	- 링커탭 이하 입력탭에서, 추가 종속성 항목에 디버그용 라이브러리 이름 추가 입력.
//  - 구성을 Release로 변경.
//  - 링커탭 이하 입력탭에서, 추가 종속성 항목의 값 맨 앞에 릴리즈용 라이브러리 이름 추가.
//
//
//
//  Thanks to Dong-Hoon Han
//	
//	
//
//																	  @Date	    2020.05.30
//																	  @Author   Taemin Im
//-----------------------------------------------------------------------------------------
#include "Pch.h"



int main()
{
	Application app;
	app.Run();
	return 0;
}


